org-headers/beamer_modern.org

# This is the master beamer file, updated with the latest goodies for beamer and org.
# In principle, all the beamer headers on the system should be substitutable by this file
# We assume LUALATEX as the standard latex engine. It uses metropolis theme as base.

#+AUTHOR:    Vittorio Zaccaria
#+EMAIL:     vittorio.zaccaria@polimi.it
#+KEYWORDS:
#+DESCRIPTION:
#+LANGUAGE:  it


#+startup: BEAMER
#+LaTeX_CLASS:         beamer
#+LaTeX_CLASS_OPTIONS: [smaller]


#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t ':t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc

#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+LATEX_HEADER: \usetheme{metropolis}
#+LaTeX_HEADER: \usepackage{fixltx2e}
#+LaTeX_HEADER: \usepackage{graphicx}
#+LaTeX_HEADER: \usepackage{longtable}
#+LaTeX_HEADER: \usepackage{float}
#+LaTeX_HEADER: \usepackage{wrapfig}
#+LaTeX_HEADER: \usepackage{rotating}
#+LaTeX_HEADER: \usepackage[normalem]{ulem}
#+LaTeX_HEADER: \usepackage{amsmath}
#+LaTeX_HEADER: \usepackage{textcomp}
#+LaTeX_HEADER: \usepackage{marvosym}
#+LaTeX_HEADER: \usepackage{wasysym}
#+LaTeX_HEADER: \usepackage{amssymb}
#+LaTeX_HEADER: \usepackage{hyperref}
#+LaTeX_HEADER: \usepackage{xcolor}

# ICONS!
#+LATEX_HEADER: \usepackage{fontawesome}

# Needed by LUALATEX and MINTED
#+LaTeX_HEADER: \usepackage{shellesc}
#+LaTeX_HEADER: \tolerance=1000
#+LaTeX_HEADER: \usepackage{minted}

# TIKZ!
#+LaTeX_HEADER: \usepackage{tikz}
#+LaTeX_HEADER: \usetikzlibrary{graphdrawing}
#+LaTeX_HEADER: \usetikzlibrary{graphs}
#+LATEX_HEADER: \usetikzlibrary{mindmap}
#+LATEX_HEADER: \usetikzlibrary{positioning}   
#+LATEX_HEADER: \usetikzlibrary{snakes}
#+LATEX_HEADER: \usetikzlibrary{arrows.meta}
#+LATEX_HEADER: \usetikzlibrary{shadows}
#+LATEX_HEADER: \usetikzlibrary{calc}
#+LATEX_HEADER: \usetikzlibrary{fit}
#+LATEX_HEADER: \usetikzlibrary{chains}
#+LATEX_HEADER: \usetikzlibrary{quotes}
#+LATEX_HEADER: \usetikzlibrary{shapes}
#+LATEX_HEADER: \usetikzlibrary{matrix}
#+LATEX_HEADER: \usetikzlibrary{positioning}
#+LATEX_HEADER: \usetikzlibrary{decorations,decorations.pathmorphing,decorations.pathreplacing}
#+LaTeX_HEADER: \usegdlibrary{trees}
#+LaTeX_HEADER: \usegdlibrary{layered}
#+LaTeX_HEADER: \usegdlibrary{force}
#+LATEX_HEADER: \usetikzlibrary{circuits.logic.US}

# And plots!
#+LATEX_HEADER: \usepackage{pgfplots}

# Import from tikzit!
#+LATEX_HEADER: \pgfdeclarelayer{edgelayer}
#+LATEX_HEADER: \pgfdeclarelayer{nodelayer}
#+LATEX_HEADER: \pgfsetlayers{edgelayer,nodelayer,main}
# Tikz defaults
#+LATEX_HEADER: \definecolor{vzorange}{rgb}{1.000,0.408,0.031}
#+LATEX_HEADER: \definecolor{vzyellow}{rgb}{1.000,0.808,0.031}
#+LATEX_HEADER: \definecolor{vzred}{rgb}{0.765,0.102,0.000}
#+LATEX_HEADER: \definecolor{vzgreen}{rgb}{0.000,0.561,0.000}
#+LATEX_HEADER: \definecolor{vzblue}{rgb}{0.000,0.000,0.861}


# # Just for the italian accents accents 
# #+LATEX_HEADER: \usepackage{polyglossia}
# #+LATEX_HEADER: \setmainlanguage{italian}

# Unicode fonts (for ASCII art)
#+LATEX_HEADER: \setmonofont[Scale=0.75]{Menlo}
#+LATEX_HEADER: \newfontfamily\myunicodefallback{Menlo}

#+LATEX_HEADER: \definecolor{links}{HTML}{0086F7}
#+LATEX_HEADER: \hypersetup{colorlinks,linkcolor=,urlcolor=links}

#+LATEX_HEADER: \newcommand{\keyboard}{{\tikz \node[box, minimum size=0cm] {\faKeyboardO};}}
#+LATEX_HEADER: \newcommand{\screen}{{\tikz \node[box, minimum size=0cm] {\faTerminal};}}


#+BEAMER_HEADER: \AtBeginSection[]{\begin{frame}[noframenumbering,plain]{Outline}\tableofcontents[currentsection]\end{frame}}

#+begin_src emacs-lisp :exports none :results silent
(setq org-latex-minted-options
   '(
   ("baselinestretch" "0.85")
     )
)
#+end_src

#+LaTeX_HEADER: \usepackage{fancyvrb}

#+BEGIN_EXPORT latex
\tikzstyle{none}=[rectangle, minimum size=1cm]
\tikzstyle{box}=[rectangle, fill=white, draw=black, minimum size=2cm, rounded corners]
\tikzstyle{sbox}=[rectangle, fill=white, draw=black, minimum width=4cm, rounded corners]
\tikzstyle{state}=[circle, scale=.5, fill=white, draw=black, minimum size=2cm, rounded corners]
\tikzstyle{boxes}=[double copy shadow, fill=white, rectangle, draw=black, minimum size=2cm, rounded corners]

\tikzstyle{container} = [blue dotted]

\tikzstyle{arrow}=[-latex]
\tikzstyle{doublearrow}=[latex-latex]
\tikzstyle{invarrow}=[latex-]
\tikzstyle{measure}=[|<->|]

% Indicate the type of an arrow
\tikzstyle{arrowlabel}     =[above, scale=.7, color=black!40]
\tikzstyle{arrowlabelabove}=[above, scale=.7, color=black!40]
\tikzstyle{arrowlabelbelow}=[below, scale=.7, color=black!40]

% Indicate a value of an arrow
\tikzstyle{varrowlabel}     =[above, scale=.5, color=black, font=\ttfamily\bfseries]
\tikzstyle{varrowlabelabove}=[above, scale=.5, color=black, font=\ttfamily\bfseries]
\tikzstyle{varrowlabelbelow}=[below, scale=.5, color=black, font=\ttfamily\bfseries]

\tikzstyle{leftlabel}      =[scale=.7, align=left]
\tikzstyle{rightlabel}     =[scale=.7, align=right]

\tikzstyle{stepdescr}=[circle, scale=.4, draw=black!40]
\tikzstyle{descr}=[scale=.5, color=black!40]
\tikzstyle{descrconnect}=[vzorange, -{Circle[]}, thick]
\tikzstyle{setconnect}=[vzorange, {Parenthesis[scale=3,reversed]}-{Circle[]}, thick]

\tikzstyle{blue dotted}=[draw=blue!50!white, line width=1pt, dash pattern=on 1pt off 4pt on 6pt off 4pt, inner sep=4mm, rectangle, rounded corners]
\tikzstyle{ribbonread}= [draw=black!20 , line width = 1.0ex , {Triangle Cap[]}-{Triangle Cap[reversed]} ]
\tikzstyle{ribbonwrite}=[draw=black!20 , line width = 1.0ex , {Triangle Cap[reversed]}-{Triangle Cap[]} ]
\tikzstyle{ribbonrw}=   [draw=black!20 , line width = 1.0ex , {Triangle Cap[]}-{Triangle Cap[]}]

\tikzstyle{matrix aspect}=[matrix of nodes, nodes={outer sep=0pt,inner sep=3pt},column sep=3em,row sep=5ex]
#+END_EXPORT

#+LATEX_HEADER: % needs latex emoji https://github.com/henningpohl/latex-emoji/blob/master/example.tex
#+LATEX_HEADER: \usepackage[twitter]{emoji}
