org-headers/beamer_modern.tex
% Created 2017-01-18 Wed 13:14
\documentclass[smaller]{beamer}


\usetheme{metropolis}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{fontawesome}
\usepackage{shellesc}
\tolerance=1000
\usepackage{minted}
\usepackage{tikz}
\usetikzlibrary{graphdrawing}
\usetikzlibrary{graphs}
\usetikzlibrary{mindmap}
\usetikzlibrary{positioning}
\usetikzlibrary{snakes}
\usetikzlibrary{arrows.meta}
\usetikzlibrary{shadows}
\usetikzlibrary{calc}
\usetikzlibrary{fit}
\usetikzlibrary{chains}
\usetikzlibrary{quotes}
\usetikzlibrary{shapes}
\usetikzlibrary{matrix}
\usetikzlibrary{positioning}
\usetikzlibrary{decorations,decorations.pathmorphing,decorations.pathreplacing}
\usegdlibrary{trees}
\usegdlibrary{layered}
\usetikzlibrary{circuits.ee.IEC}
\usepackage{pgfplots}
\pgfdeclarelayer{edgelayer}
\pgfdeclarelayer{nodelayer}
\pgfsetlayers{edgelayer,nodelayer,main}
\definecolor{vzorange}{rgb}{1.000,0.408,0.031}
\definecolor{vzyellow}{rgb}{1.000,0.808,0.031}
\definecolor{vzred}{rgb}{0.765,0.102,0.000}
\definecolor{vzgreen}{rgb}{0.000,0.561,0.000}
\definecolor{vzblue}{rgb}{0.000,0.000,0.861}
\setmonofont[Scale=0.75]{Menlo}
\newfontfamily\myunicodefallback{Menlo}
\newcommand{\keyboard}{{\tikz \node[box, minimum size=0cm] {\faKeyboardO};}}
\newcommand{\screen}{{\tikz \node[box, minimum size=0cm] {\faTerminal};}}
\usepackage{fancyvrb}
% needs latex emoji https://github.com/henningpohl/latex-emoji/blob/master/example.tex
\usepackage[twitter]{emoji}
\usetheme{default}
\author{Vittorio Zaccaria}
\date{\today}
\title{}
\AtBeginSection[]{\begin{frame}[noframenumbering,plain]{Outline}\tableofcontents[currentsection]\end{frame}}
\hypersetup{
 pdfauthor={Vittorio Zaccaria},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.6)}, 
 pdflang={Italian}}
\begin{document}

\begin{frame}{Outline}
\tableofcontents
\end{frame}

\tikzstyle{none}=[rectangle, minimum size=1cm]
\tikzstyle{box}=[rectangle, fill=white, draw=black, minimum size=2cm, rounded corners]
\tikzstyle{sbox}=[rectangle, fill=white, draw=black, minimum width=4cm, rounded corners]
\tikzstyle{state}=[circle, fill=white, draw=black, minimum width=2cm, rounded corners]
\tikzstyle{boxes}=[double copy shadow, fill=white, rectangle, draw=black, minimum size=2cm, rounded corners]

\tikzstyle{container} = [blue dotted]

\tikzstyle{arrow}=[-latex]
\tikzstyle{doublearrow}=[latex-latex]
\tikzstyle{invarrow}=[latex-]
\tikzstyle{measure}=[|<->|]

% Indicate the type of an arrow
\tikzstyle{arrowlabel}     =[above, scale=.7, color=black!40]
\tikzstyle{arrowlabelabove}=[above, scale=.7, color=black!40]
\tikzstyle{arrowlabelbelow}=[below, scale=.7, color=black!40]

% Indicate a value of an arrow
\tikzstyle{varrowlabel}     =[above, scale=.5, color=black, font=\ttfamily\bfseries]
\tikzstyle{varrowlabelabove}=[above, scale=.5, color=black, font=\ttfamily\bfseries]
\tikzstyle{varrowlabelbelow}=[below, scale=.5, color=black, font=\ttfamily\bfseries]

\tikzstyle{leftlabel}      =[scale=.7, align=left]
\tikzstyle{rightlabel}     =[scale=.7, align=right]

\tikzstyle{stepdescr}=[circle, scale=.4, draw=black!40]
\tikzstyle{descr}=[scale=.5, color=black!40]
\tikzstyle{descrconnect}=[vzorange, -{Circle[]}, thick]
\tikzstyle{setconnect}=[vzorange, {Parenthesis[scale=3,reversed]}-{Circle[]}, thick]

\tikzstyle{blue dotted}=[draw=blue!50!white, line width=1pt, dash pattern=on 1pt off 4pt on 6pt off 4pt, inner sep=4mm, rectangle, rounded corners]
\tikzstyle{ribbonread}= [draw=black!20 , line width = 1.0ex , {Triangle Cap[]}-{Triangle Cap[reversed]} ]
\tikzstyle{ribbonwrite}=[draw=black!20 , line width = 1.0ex , {Triangle Cap[reversed]}-{Triangle Cap[]} ]
\tikzstyle{ribbonrw}=   [draw=black!20 , line width = 1.0ex , {Triangle Cap[]}-{Triangle Cap[]}]

\tikzstyle{matrix aspect}=[matrix of nodes, nodes={outer sep=0pt,inner sep=3pt},column sep=3em,row sep=5ex]
\end{document}